# кодировка: utf-8

# Строка имеет метод длины, который возвращает количество символов в строке
ставит  ' Я объект типа строка! ' .length

# Целое число имеет метод to_f.
# число с плавающей точкой
ставит  17 .to_f

# Чем целые числа отличаются от вещественных (почему это разные типы объектов):
#
# http://ru.wikipedia.org/wiki/Вещественные_числа
# http://ru.wikipedia.org/wiki/Целое_число

# Описание классов String (строка), Fixnum (целое число), Float (вещественное
# Число или число с плавающим точком) и доступные объекты эти классы свойства
# из документации Руби:
#
# http://www.ruby-doc.org/core-2.4.0/String.html
# http://www.ruby-doc.org/core-2.4.0/Fixnum.html
# http://www.ruby-doc.org/core-2.4.0/Float.html